zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_spi.c
    if (CYHAL_SYSPM_CB_CPU_DEEPSLEEP == state)
        allow = (CY_SYSPM_SUCCESS == Cy_SCB_SPI_DeepSleepCallback(&spi_callback_params, pdl_mode));
#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1B)
    else if (CYHAL_SYSPM_CB_SYSTEM_HIBERNATE == state)
        allow = (CY_SYSPM_SUCCESS == Cy_SCB_SPI_HibernateCallback(&spi_callback_params, pdl_mode));
#endif

    return allow;
}

static cy_rslt_t _cyhal_spi_get_ssel_map_idx(cyhal_gpio_t ssel, const cyhal_resource_pin_mapping_t **ssel_map,
                    uint8_t *idx, const cyhal_resource_inst_t *target_blk)
{
    #ifdef CY_IP_M0S8SCB
    /* SSEL0 is only available for Slave on M0S8SCB */
    static const cyhal_resource_pin_mapping_t *ssel_s_pin_maps[] = { cyhal_pin_map_scb_spi_s_select0 };
    static const size_t ssel_s_pin_maps_sizes_bytes[] = { sizeof(cyhal_pin_map_scb_spi_s_select0) };
    #else
    static const cyhal_resource_pin_mapping_t *ssel_s_pin_maps[] = {
        cyhal_pin_map_scb_spi_s_select0, cyhal_pin_map_scb_spi_s_select1,
        cyhal_pin_map_scb_spi_s_select2, cyhal_pin_map_scb_spi_s_select3 };
    static const size_t ssel_s_pin_maps_sizes_bytes[] = {
        sizeof(cyhal_pin_map_scb_spi_s_select0), sizeof(cyhal_pin_map_scb_spi_s_select1),
        sizeof(cyhal_pin_map_scb_spi_s_select2), sizeof(cyhal_pin_map_scb_spi_s_select3) };
    #endif /* M0S8 version of SCB or other */
    for (uint8_t i = 0; i < sizeof(ssel_s_pin_maps) / sizeof(ssel_s_pin_maps[0]); i++)
    {
        *ssel_map = _cyhal_scb_find_map(ssel, ssel_s_pin_maps[i],
                        ssel_s_pin_maps_sizes_bytes[i] / sizeof(cyhal_resource_pin_mapping_t), target_blk);
        if (NULL != *ssel_map)
        {
            *idx = i;
            return CY_RSLT_SUCCESS;
        }
    }
    return CYHAL_SPI_RSLT_ERR_CANNOT_CONFIG_SSEL;
}

static inline cy_en_scb_spi_polarity_t _cyhal_spi_pol_from_hal_to_pdl(cyhal_spi_ssel_polarity_t hal_polarity)
{
    return (hal_polarity == CYHAL_SPI_SSEL_ACTIVE_HIGH) ? CY_SCB_SPI_ACTIVE_HIGH : CY_SCB_SPI_ACTIVE_LOW;
}

static cy_rslt_t _cyhal_spi_ssel_config(cyhal_spi_t *obj, cyhal_gpio_t ssel,
                                        cyhal_spi_ssel_polarity_t polarity, bool reserve_n_connect)
{
    cy_rslt_t result = CYHAL_SPI_RSLT_ERR_CANNOT_CONFIG_SSEL;
    uint8_t found_idx = 0;
    bool configuring_existing = false;
    if ((NC != ssel) && (_CYHAL_SPI_PENDING_NONE == obj->pending))
    {
        for (uint8_t i = 0; i < _CYHAL_SPI_SSEL_NUM; i++)
        {
            if ((configuring_existing = (ssel == obj->pin_ssel[i])))
            {
                result = CY_RSLT_SUCCESS;
                found_idx = i;
                break;
            }
            if (!obj->is_slave)
            {
                /* Looking for first available ssel slot */
                if ((NC == obj->pin_ssel[i]))
                {
                    result = reserve_n_connect ? cyhal_gpio_init(ssel, CYHAL_GPIO_DIR_OUTPUT, CYHAL_GPIO_DRIVE_STRONG,
                                (polarity == CYHAL_SPI_SSEL_ACTIVE_LOW) ? true : false) : CY_RSLT_SUCCESS;
                    found_idx = i;
                    break;
                }
            }
        }
        if (!configuring_existing && (obj->is_slave))
        {
            const cyhal_resource_pin_mapping_t *ssel_map = NULL;
            if (CY_RSLT_SUCCESS == _cyhal_spi_get_ssel_map_idx(ssel, &ssel_map, &found_idx, &(obj->resource)))
            {
                /* Either mosi or miso should present. Will take one of them as instance SCB instance index source */
                const cyhal_resource_pin_mapping_t *data_pin_map = (NC != obj->pin_mosi)
                    ? _CYHAL_SCB_FIND_MAP_BLOCK(obj->pin_mosi, cyhal_pin_map_scb_spi_s_mosi, &(obj->resource))
                    : _CYHAL_SCB_FIND_MAP_BLOCK(obj->pin_miso, cyhal_pin_map_scb_spi_s_miso, &(obj->resource));

                if ((NULL != ssel_map) && (NC == obj->pin_ssel[found_idx]) &&
                    _cyhal_utils_map_resources_equal(data_pin_map, ssel_map))
                {
                    result = reserve_n_connect
                        ? _cyhal_utils_reserve_and_connect(ssel_map, CYHAL_PIN_MAP_DRIVE_MODE_SCB_SPI_S_SELECT0)
                        : CY_RSLT_SUCCESS;
                }
            }
        }
        if (CY_RSLT_SUCCESS == result)
        {
            if (!configuring_existing)
                obj->pin_ssel[found_idx] = ssel;
            obj->ssel_pol[found_idx] = _cyhal_spi_pol_from_hal_to_pdl(polarity);

            /* Immediately apply updated slave select polarity */
            Cy_SCB_SPI_SetActiveSlaveSelectPolarity(obj->base, (cy_en_scb_spi_slave_select_t)found_idx, obj->ssel_pol[found_idx]);
            if (!obj->is_slave)
                _cyhal_ssel_switch_state(obj, found_idx, _CYHAL_SPI_SSEL_DEACTIVATE);
        }
    }
    return result;
}

cy_rslt_t cyhal_spi_init(cyhal_spi_t *obj, cyhal_gpio_t mosi, cyhal_gpio_t miso, cyhal_gpio_t sclk, cyhal_gpio_t ssel,
                         const cyhal_clock_t *clk, uint8_t bits, cyhal_spi_mode_t mode, bool is_slave)
{
    CY_ASSERT(NULL != obj);

    cy_stc_scb_spi_config_t driver_config = _cyhal_spi_default_config;
    driver_config.spiMode = is_slave == 0
        ? CY_SCB_SPI_MASTER
        : CY_SCB_SPI_SLAVE;
    driver_config.enableMsbFirst = _is_cyhal_mode_msb(mode);
    driver_config.sclkMode = _cyhal_convert_mode_sclk(mode);
    driver_config.rxDataWidth = bits;
    driver_config.txDataWidth = bits;
    driver_config.ssPolarity = ((CY_SCB_SPI_ACTIVE_LOW << CY_SCB_SPI_SLAVE_SELECT0) | \
                                (CY_SCB_SPI_ACTIVE_LOW << CY_SCB_SPI_SLAVE_SELECT1) | \
                                (CY_SCB_SPI_ACTIVE_LOW << CY_SCB_SPI_SLAVE_SELECT2) | \
                                (CY_SCB_SPI_ACTIVE_LOW << CY_SCB_SPI_SLAVE_SELECT3));
    cyhal_spi_configurator_t cfg = {
        .resource = NULL,
        .config = &driver_config,
        .clock = clk,
        .gpios = { sclk, { ssel, NC, NC, NC }, mosi, miso }
    };

    return cyhal_spi_init_cfg(obj, &cfg);
}

cy_rslt_t cyhal_spi_init_cfg(cyhal_spi_t *obj, const cyhal_spi_configurator_t *cfg)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != cfg);
    CY_ASSERT(NULL != cfg->config);

    memset(obj, 0, sizeof(cyhal_spi_t));

    obj->dc_configured = (NULL != cfg->resource);
    cy_stc_scb_spi_config_t cfg_local = *cfg->config;

    if (obj->dc_configured &&
       ((cfg_local.subMode != CY_SCB_SPI_MOTOROLA) ||
        (cfg_local.rxFifoIntEnableMask != 0) ||
        (cfg_local.txFifoIntEnableMask != 0) ||
        (cfg_local.masterSlaveIntEnableMask != 0) ||
        (cfg_local.rxDataWidth != cfg_local.txDataWidth)))
    {
        /* Next SPI personality (device configurator) items are NOT supported by SPI HAL:
        - Modes: TI (Start Coincides), TI (Start Precedes), National Semiconductor (Microwire)
        - Low-level RX Interrupt sources
        - Low-level TX Interrupt sources
        - SPI Done Master interrupt source
        - Different data width for RX and TX
        */
        return CYHAL_SPI_RSLT_ERR_CFG_NOT_SUPPORTED;
    }

    cy_rslt_t result = CY_RSLT_SUCCESS;
    uint8_t ovr_sample_val = _CYHAL_SPI_OVERSAMPLE_MIN;
    obj->pending = _CYHAL_SPI_PENDING_NONE;

    // Explicitly marked not allocated resources as invalid to prevent freeing them.
    obj->resource.type = CYHAL_RSC_INVALID;
    obj->pin_miso = NC;
    obj->pin_mosi = NC;
    obj->pin_sclk = NC;

    for (uint8_t i = 0; i < _CYHAL_SPI_SSEL_NUM; i++)
    {
        obj->pin_ssel[i] = NC;
        obj->ssel_pol[i] = CY_SCB_SPI_ACTIVE_LOW;
    }

    obj->write_fill = (uint8_t) CY_SCB_SPI_DEFAULT_TX;
    obj->active_ssel = 0;

    bool is_slave = (cfg_local.spiMode == CY_SCB_SPI_SLAVE);

    cyhal_gpio_t ssel = NC;
    cyhal_gpio_t sclk = cfg->gpios.sclk;
    cyhal_gpio_t mosi = cfg->gpios.mosi;
    cyhal_gpio_t miso = cfg->gpios.miso;

    size_t found_cfg_ssel_pos = 0;

    for (size_t ssel_idx = 0; ssel_idx < sizeof(cfg->gpios.ssel) / sizeof(cfg->gpios.ssel[0]); ++ssel_idx)
    {
        if (NC != cfg->gpios.ssel[ssel_idx])
        {
            ssel = cfg->gpios.ssel[ssel_idx];
            found_cfg_ssel_pos = ssel_idx;
            break;
        }
    }

    /* Validate pins configuration. Mandatory pins:*/
    /* Master mode: MOSI pin used, MISO unused:     SCLK, SSEL are optional */
    /* Master mode: MISO pin used, MOSI unused:     SCLK is mandatory, MOSI, SSEL are optional */
    /* Slave  mode: MOSI or MISO are used:          SCLK and SSEL are mandatory */

    /* Slave */
    if (is_slave)
    {
        if ((NC == sclk) || (NC == ssel) || ((NC == mosi) && (NC == miso)))
        {
            return CYHAL_SPI_RSLT_PIN_CONFIG_NOT_SUPPORTED;
        }
    }
    /* Master */
    else
    {
        if ((NC != miso && NC == sclk) || (NC == mosi && NC == miso))
        {
            return CYHAL_SPI_RSLT_PIN_CONFIG_NOT_SUPPORTED;
        }
    }

    obj->is_slave = is_slave;

    /* Get pin configurations */
    const cyhal_resource_pin_mapping_t *mosi_map = NULL;
    const cyhal_resource_pin_mapping_t *miso_map = NULL;
    const cyhal_resource_pin_mapping_t *sclk_map = NULL;
    const cyhal_resource_pin_mapping_t *ssel_map = NULL;
    uint8_t mosi_dm, miso_dm, sclk_dm;
    uint8_t active_ssel = 0;

